 I'm using 1.9.2, I didn't know there was a 1.9.3-rc1. Anyway I upgraded to 1.9.3-rc1 and te problem is exacly the same.

**Version 1.9.3-rc1  with add_wg_access      = true**

# grid_network.netteste_3021 will be created
  + resource "grid_network" "netteste_3021" {
      + access_wg_config   = (known after apply)
      + add_wg_access      = true
      + description        = "SomeNetwork"
      + external_ip        = (known after apply)
      + external_sk        = (known after apply)
      + id                 = (known after apply)
      + ip_range           = "10.32.0.0/16"
      + name               = "netteste_3021"
      + node_deployment_id = (known after apply)
      + nodes              = [
          + 3021,
        ]
      + nodes_ip_range     = (known after apply)
      + public_node_id     = (known after apply)
      + solution_type      = "Network"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ygg_ip_3021 = (known after apply)
grid_network.netteste_3021: Creating...
grid_network.netteste_3021: Still creating... [10s elapsed]
grid_network.netteste_3021: Still creating... [20s elapsed]
╷
│ Error: could not generate deployments data: failed to get node 1 endpoint: could not list node interfaces: context deadline exceeded

Version 1.9.3-rc1  with add_wg_access      = false



 # grid_network.netteste_3021 will be created
  + resource "grid_network" "netteste_3021" {
      + access_wg_config   = (known after apply)
      + add_wg_access      = false
      + description        = "SomeNetwork"
      + external_ip        = (known after apply)
      + external_sk        = (known after apply)
      + id                 = (known after apply)
      + ip_range           = "10.32.0.0/16"
      + name               = "netteste_3021"
      + node_deployment_id = (known after apply)
      + nodes              = [
          + 3021,
        ]
      + nodes_ip_range     = (known after apply)
      + public_node_id     = (known after apply)
      + solution_type      = "Network"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ygg_ip_3021 = (known after apply)
grid_network.netteste_3021: Creating...
grid_network.netteste_3021: Creation complete after 6s [id=a204ee8d-d755-475d-bb2b-e9e88b3543b5]
grid_deployment._3021: Creating...
grid_deployment._3021: Still creating... [10s elapsed]
grid_deployment._3021: Creation complete after 11s [id=94036]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.